GrumpyOldPizza/ArduinoCore-stm32l0/boards.txt
# UT2UH K33-L082Z-DFU
# ---------------------------------------
K33-L082Z-DFU.name=K33-L082Z-DFU
K33-L082Z-DFU.vid.0=0x1209
K33-L082Z-DFU.pid.0=0x6662

K33-L082Z-DFU.upload.tool=stm32l0_dfu
K33-L082Z-DFU.upload.protocol=dfu
K33-L082Z-DFU.upload.maximum_size=196608
K33-L082Z-DFU.upload.maximum_data_size=20480
K33-L082Z-DFU.upload.use_1200bps_touch=true
K33-L082Z-DFU.upload.wait_for_upload_port=false
K33-L082Z-DFU.upload.native_usb=false

K33-L082Z-DFU.build.mcu=cortex-m0plus
K33-L082Z-DFU.build.f_cpu=32000000L
K33-L082Z-DFU.build.board=K33_DFU
K33-L082Z-DFU.build.arch=stm32l0
K33-L082Z-DFU.build.core=arduino
K33-L082Z-DFU.build.vid=0x1209
K33-L082Z-DFU.build.pid=0x6662
K33-L082Z-DFU.build.did=0xffff
K33-L082Z-DFU.build.usb_manufacturer="UT2UH"
K33-L082Z-DFU.build.usb_product="K33"
K33-L082Z-DFU.build.extra_flags=-DSTM32L082xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
K33-L082Z-DFU.build.ldscript=linker_scripts/STM32L082CZ_FLASH.ld
K33-L082Z-DFU.build.openocdscript=openocd_scripts/k33_usb.cfg
K33-L082Z-DFU.build.variant=K33-L082Z-DFU
K33-L082Z-DFU.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l082xx -larm_cortexM0l_math
K33-L082Z-DFU.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

K33-L082Z-DFU.menu.usb.cdc=Serial
K33-L082Z-DFU.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
K33-L082Z-DFU.menu.usb.cdc_msc=Serial + Mass Storage
K33-L082Z-DFU.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
K33-L082Z-DFU.menu.usb.none=No USB
K33-L082Z-DFU.menu.usb.none.build.usb_type=USB_TYPE_NONE

K33-L082Z-DFU.menu.speed.32=32 MHz
K33-L082Z-DFU.menu.speed.32.build.f_cpu=32000000L
K33-L082Z-DFU.menu.speed.16=16 MHz (No USB)
K33-L082Z-DFU.menu.speed.16.build.f_cpu=16000000L
K33-L082Z-DFU.menu.speed.4=4.2 MHz (No USB)
K33-L082Z-DFU.menu.speed.4.build.f_cpu=4200000L

K33-L082Z-DFU.menu.opt.os=Smallest Code
K33-L082Z-DFU.menu.opt.os.build.flags.optimize=-Os
K33-L082Z-DFU.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
K33-L082Z-DFU.menu.opt.o1=Fast
K33-L082Z-DFU.menu.opt.o1.build.flags.optimize=-O1
K33-L082Z-DFU.menu.opt.o1.build.flags.ldspecs=
K33-L082Z-DFU.menu.opt.o2=Faster
K33-L082Z-DFU.menu.opt.o2.build.flags.optimize=-O2
K33-L082Z-DFU.menu.opt.o2.build.flags.ldspecs=
K33-L082Z-DFU.menu.opt.o3=Fastest
K33-L082Z-DFU.menu.opt.o3.build.flags.optimize=-O3
K33-L082Z-DFU.menu.opt.o3.build.flags.ldspecs=


# AI_Thinker/RuiXingHengFang/RisingHF RHF76-052
# ---------------------------------------
RHF76-052.name=RHF76-052
RHF76-052.vid.0=0x0483
RHF76-052.pid.0=0x374e

RHF76-052.upload.tool=stm32l0_openocd
RHF76-052.upload.protocol=stlink
RHF76-052.upload.maximum_size=65536
RHF76-052.upload.maximum_data_size=8192
RHF76-052.upload.use_1200bps_touch=true
RHF76-052.upload.wait_for_upload_port=false
RHF76-052.upload.native_usb=false

RHF76-052.build.mcu=cortex-m0plus
RHF76-052.build.f_cpu=32000000L
RHF76-052.build.board=RHF76_052
RHF76-052.build.arch=stm32l0
RHF76-052.build.core=arduino
RHF76-052.build.vid=0x0483
RHF76-052.build.pid=0x374e
RHF76-052.build.did=0xffff
RHF76-052.build.extra_flags=-DSTM32L052xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
RHF76-052.build.ldscript=linker_scripts/STM32L052C8_FLASH.ld
RHF76-052.build.openocdscript=openocd_scripts/rhf76-l051c8.cfg
RHF76-052.build.variant=RHF76-052
RHF76-052.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l052xx -larm_cortexM0l_math
RHF76-052.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include"

RHF76-052.menu.speed.32=32 MHz
RHF76-052.menu.speed.32.build.f_cpu=32000000L
RHF76-052.menu.speed.16=16 MHz
RHF76-052.menu.speed.16.build.f_cpu=16000000L
RHF76-052.menu.speed.4=4.2 MHz
RHF76-052.menu.speed.4.build.f_cpu=4200000L

RHF76-052.menu.opt.os=Smallest Code
RHF76-052.menu.opt.os.build.flags.optimize=-Os
RHF76-052.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
RHF76-052.menu.opt.o1=Fast
RHF76-052.menu.opt.o1.build.flags.optimize=-O1
RHF76-052.menu.opt.o1.build.flags.ldspecs=
RHF76-052.menu.opt.o2=Faster
RHF76-052.menu.opt.o2.build.flags.optimize=-O2
RHF76-052.menu.opt.o2.build.flags.ldspecs=
RHF76-052.menu.opt.o3=Fastest
RHF76-052.menu.opt.o3.build.flags.optimize=-O3
RHF76-052.menu.opt.o3.build.flags.ldspecs=


# LILYGO T-Impulse-S76G
# ---------------------------------------
T-IMPULSE-S76G.name=T-IMPULSE-S76G
T-IMPULSE-S76G.vid.0=0x0483
T-IMPULSE-S76G.pid.0=0xDF11

T-IMPULSE-S76G.upload.tool=stm32l0_dfu
T-IMPULSE-S76G.upload.protocol=dfu
T-IMPULSE-S76G.upload.maximum_size=196608
T-IMPULSE-S76G.upload.maximum_data_size=20480
T-IMPULSE-S76G.upload.use_1200bps_touch=true
T-IMPULSE-S76G.upload.wait_for_upload_port=false
T-IMPULSE-S76G.upload.native_usb=false

T-IMPULSE-S76G.build.mcu=cortex-m0plus
T-IMPULSE-S76G.build.f_cpu=32000000L
T-IMPULSE-S76G.build.board=T_IMPULSE
T-IMPULSE-S76G.build.arch=stm32l0
T-IMPULSE-S76G.build.core=arduino
T-IMPULSE-S76G.build.vid=0x0483
T-IMPULSE-S76G.build.pid=0xDF11
T-IMPULSE-S76G.build.did=0xffff
T-IMPULSE-S76G.build.usb_manufacturer="LILYGO"
T-IMPULSE-S76G.build.usb_product="TIMPULSE"
T-IMPULSE-S76G.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
T-IMPULSE-S76G.build.ldscript=linker_scripts/STM32L073RZ_FLASH.ld
T-IMPULSE-S76G.build.openocdscript=openocd_scripts/s7xg-l073rz.cfg
T-IMPULSE-S76G.build.variant=T-IMPULSE-S76G
T-IMPULSE-S76G.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
T-IMPULSE-S76G.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

T-IMPULSE-S76G.menu.usb.cdc=Serial
T-IMPULSE-S76G.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
T-IMPULSE-S76G.menu.usb.cdc_msc=Serial + Mass Storage
T-IMPULSE-S76G.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
T-IMPULSE-S76G.menu.usb.none=No USB
T-IMPULSE-S76G.menu.usb.none.build.usb_type=USB_TYPE_NONE

