GrumpyOldPizza/ArduinoCore-stm32l0/boards.txt
T-IMPULSE-S76G.menu.speed.32=32 MHz
T-IMPULSE-S76G.menu.speed.32.build.f_cpu=32000000L

T-IMPULSE-S76G.menu.opt.os=Smallest Code
T-IMPULSE-S76G.menu.opt.os.build.flags.optimize=-Os
T-IMPULSE-S76G.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
T-IMPULSE-S76G.menu.opt.o1=Fast
T-IMPULSE-S76G.menu.opt.o1.build.flags.optimize=-O1
T-IMPULSE-S76G.menu.opt.o1.build.flags.ldspecs=
T-IMPULSE-S76G.menu.opt.o2=Faster
T-IMPULSE-S76G.menu.opt.o2.build.flags.optimize=-O2
T-IMPULSE-S76G.menu.opt.o2.build.flags.ldspecs=
T-IMPULSE-S76G.menu.opt.o3=Fastest
T-IMPULSE-S76G.menu.opt.o3.build.flags.optimize=-O3
T-IMPULSE-S76G.menu.opt.o3.build.flags.ldspecs=


# DRAGINO LGT92-L072Z
# ---------------------------------------
LGT92-L072Z.name=LGT92-L072Z
LGT92-L072Z.vid.0=0x0483
LGT92-L072Z.pid.0=0x374e

LGT92-L072Z.upload.tool=stm32l0_openocd
LGT92-L072Z.upload.protocol=stlink
LGT92-L072Z.upload.maximum_size=196608
LGT92-L072Z.upload.maximum_data_size=20480
LGT92-L072Z.upload.use_1200bps_touch=true
LGT92-L072Z.upload.wait_for_upload_port=false
LGT92-L072Z.upload.native_usb=false

LGT92-L072Z.build.mcu=cortex-m0plus
LGT92-L072Z.build.f_cpu=32000000L
LGT92-L072Z.build.board=LGT92
LGT92-L072Z.build.arch=stm32l0
LGT92-L072Z.build.core=arduino
LGT92-L072Z.build.vid=0x0483
LGT92-L072Z.build.pid=0x374e
LGT92-L072Z.build.did=0xffff
LGT92-L072Z.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
LGT92-L072Z.build.ldscript=linker_scripts/STM32L072CZ_FLASH.ld
LGT92-L072Z.build.openocdscript=openocd_scripts/lgt92_l072cz.cfg
LGT92-L072Z.build.variant=LGT92-L072Z
LGT92-L072Z.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
LGT92-L072Z.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

LGT92-L072Z.menu.speed.32=32 MHz
LGT92-L072Z.menu.speed.32.build.f_cpu=32000000L
LGT92-L072Z.menu.speed.16=16 MHz (No USB)
LGT92-L072Z.menu.speed.16.build.f_cpu=16000000L
LGT92-L072Z.menu.speed.4=4.2 MHz (No USB)
LGT92-L072Z.menu.speed.4.build.f_cpu=4200000L

LGT92-L072Z.menu.opt.os=Smallest Code
LGT92-L072Z.menu.opt.os.build.flags.optimize=-Os
LGT92-L072Z.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
LGT92-L072Z.menu.opt.o1=Fast
LGT92-L072Z.menu.opt.o1.build.flags.optimize=-O1
LGT92-L072Z.menu.opt.o1.build.flags.ldspecs=
LGT92-L072Z.menu.opt.o2=Faster
LGT92-L072Z.menu.opt.o2.build.flags.optimize=-O2
LGT92-L072Z.menu.opt.o2.build.flags.ldspecs=
LGT92-L072Z.menu.opt.o3=Fastest
LGT92-L072Z.menu.opt.o3.build.flags.optimize=-O3
LGT92-L072Z.menu.opt.o3.build.flags.ldspecs=
